IFX-Jenson/PSoC62_ili9341_SPI_2.8inch_TFT_LVGL_demo/LVGL_Demo_2.8/bsps/TARGET_APP_CY8CEVAL-062S2/config/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_BUTTON0_ROW_IDAC_MOD2_VALUE                                  (cy_capsense_tuner.widgetContext[0].rowIdacMod[2])
#define CY_CAPSENSE_BUTTON0_ROW_IDAC_MOD2_OFFSET                                 (66u)
#define CY_CAPSENSE_BUTTON0_ROW_IDAC_MOD2_SIZE                                   (1u)
#define CY_CAPSENSE_BUTTON0_ROW_IDAC_MOD2_PARAM_ID                               (0x05000042u)

#define CY_CAPSENSE_BUTTON0_REGULAR_IIR_BL_N_VALUE                               (cy_capsense_tuner.widgetContext[0].bslnCoeff)
#define CY_CAPSENSE_BUTTON0_REGULAR_IIR_BL_N_OFFSET                              (67u)
#define CY_CAPSENSE_BUTTON0_REGULAR_IIR_BL_N_SIZE                                (1u)
#define CY_CAPSENSE_BUTTON0_REGULAR_IIR_BL_N_PARAM_ID                            (0x05000043u)

#define CY_CAPSENSE_BUTTON0_STATUS_VALUE                                         (cy_capsense_tuner.widgetContext[0].status)
#define CY_CAPSENSE_BUTTON0_STATUS_OFFSET                                        (68u)
#define CY_CAPSENSE_BUTTON0_STATUS_SIZE                                          (1u)
#define CY_CAPSENSE_BUTTON0_STATUS_PARAM_ID                                      (0x01000044u)

#define CY_CAPSENSE_BUTTON0_PTRPOSITION_VALUE                                    (cy_capsense_tuner.widgetContext[0].wdTouch.ptrPosition)
#define CY_CAPSENSE_BUTTON0_PTRPOSITION_OFFSET                                   (72u)
#define CY_CAPSENSE_BUTTON0_PTRPOSITION_SIZE                                     (4u)
#define CY_CAPSENSE_BUTTON0_PTRPOSITION_PARAM_ID                                 (0x03000048u)

#define CY_CAPSENSE_BUTTON0_NUM_POSITIONS_VALUE                                  (cy_capsense_tuner.widgetContext[0].wdTouch.numPosition)
#define CY_CAPSENSE_BUTTON0_NUM_POSITIONS_OFFSET                                 (76u)
#define CY_CAPSENSE_BUTTON0_NUM_POSITIONS_SIZE                                   (1u)
#define CY_CAPSENSE_BUTTON0_NUM_POSITIONS_PARAM_ID                               (0x0100004cu)

#define CY_CAPSENSE_BUTTON1_FINGER_CP_VALUE                                      (cy_capsense_tuner.widgetContext[1].fingerCap)
#define CY_CAPSENSE_BUTTON1_FINGER_CP_OFFSET                                     (80u)
#define CY_CAPSENSE_BUTTON1_FINGER_CP_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON1_FINGER_CP_PARAM_ID                                   (0x06010050u)

#define CY_CAPSENSE_BUTTON1_SIGPFC_VALUE                                         (cy_capsense_tuner.widgetContext[1].sigPFC)
#define CY_CAPSENSE_BUTTON1_SIGPFC_OFFSET                                        (82u)
#define CY_CAPSENSE_BUTTON1_SIGPFC_SIZE                                          (2u)
#define CY_CAPSENSE_BUTTON1_SIGPFC_PARAM_ID                                      (0x06010052u)

#define CY_CAPSENSE_BUTTON1_NUM_CONV_VALUE                                       (cy_capsense_tuner.widgetContext[1].resolution)
#define CY_CAPSENSE_BUTTON1_NUM_CONV_OFFSET                                      (84u)
#define CY_CAPSENSE_BUTTON1_NUM_CONV_SIZE                                        (2u)
#define CY_CAPSENSE_BUTTON1_NUM_CONV_PARAM_ID                                    (0x06010054u)

#define CY_CAPSENSE_BUTTON1_MAX_RAW_COUNT_VALUE                                  (cy_capsense_tuner.widgetContext[1].maxRawCount)
#define CY_CAPSENSE_BUTTON1_MAX_RAW_COUNT_OFFSET                                 (86u)
#define CY_CAPSENSE_BUTTON1_MAX_RAW_COUNT_SIZE                                   (2u)
#define CY_CAPSENSE_BUTTON1_MAX_RAW_COUNT_PARAM_ID                               (0x06010056u)

#define CY_CAPSENSE_BUTTON1_ROW_MAX_RAW_COUNT_VALUE                              (cy_capsense_tuner.widgetContext[1].maxRawCountRow)
#define CY_CAPSENSE_BUTTON1_ROW_MAX_RAW_COUNT_OFFSET                             (88u)
#define CY_CAPSENSE_BUTTON1_ROW_MAX_RAW_COUNT_SIZE                               (2u)
#define CY_CAPSENSE_BUTTON1_ROW_MAX_RAW_COUNT_PARAM_ID                           (0x06010058u)

#define CY_CAPSENSE_BUTTON1_FINGER_TH_VALUE                                      (cy_capsense_tuner.widgetContext[1].fingerTh)
#define CY_CAPSENSE_BUTTON1_FINGER_TH_OFFSET                                     (90u)
#define CY_CAPSENSE_BUTTON1_FINGER_TH_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON1_FINGER_TH_PARAM_ID                                   (0x0601005au)

#define CY_CAPSENSE_BUTTON1_PROX_TOUCH_TH_VALUE                                  (cy_capsense_tuner.widgetContext[1].proxTh)
#define CY_CAPSENSE_BUTTON1_PROX_TOUCH_TH_OFFSET                                 (92u)
#define CY_CAPSENSE_BUTTON1_PROX_TOUCH_TH_SIZE                                   (2u)
#define CY_CAPSENSE_BUTTON1_PROX_TOUCH_TH_PARAM_ID                               (0x0601005cu)

#define CY_CAPSENSE_BUTTON1_LOW_BSLN_RST_VALUE                                   (cy_capsense_tuner.widgetContext[1].lowBslnRst)
#define CY_CAPSENSE_BUTTON1_LOW_BSLN_RST_OFFSET                                  (94u)
#define CY_CAPSENSE_BUTTON1_LOW_BSLN_RST_SIZE                                    (2u)
#define CY_CAPSENSE_BUTTON1_LOW_BSLN_RST_PARAM_ID                                (0x0601005eu)

#define CY_CAPSENSE_BUTTON1_TX_CLK_VALUE                                         (cy_capsense_tuner.widgetContext[1].snsClk)
#define CY_CAPSENSE_BUTTON1_TX_CLK_OFFSET                                        (96u)
#define CY_CAPSENSE_BUTTON1_TX_CLK_SIZE                                          (2u)
#define CY_CAPSENSE_BUTTON1_TX_CLK_PARAM_ID                                      (0x06010060u)

#define CY_CAPSENSE_BUTTON1_ROW_SNS_CLK_VALUE                                    (cy_capsense_tuner.widgetContext[1].rowSnsClk)
#define CY_CAPSENSE_BUTTON1_ROW_SNS_CLK_OFFSET                                   (98u)
#define CY_CAPSENSE_BUTTON1_ROW_SNS_CLK_SIZE                                     (2u)
#define CY_CAPSENSE_BUTTON1_ROW_SNS_CLK_PARAM_ID                                 (0x06010062u)

#define CY_CAPSENSE_BUTTON1_GESTURE_DETECTED_VALUE                               (cy_capsense_tuner.widgetContext[1].gestureDetected)
#define CY_CAPSENSE_BUTTON1_GESTURE_DETECTED_OFFSET                              (100u)
#define CY_CAPSENSE_BUTTON1_GESTURE_DETECTED_SIZE                                (2u)
#define CY_CAPSENSE_BUTTON1_GESTURE_DETECTED_PARAM_ID                            (0x02010064u)

#define CY_CAPSENSE_BUTTON1_GESTURE_DIRECTION_VALUE                              (cy_capsense_tuner.widgetContext[1].gestureDirection)
#define CY_CAPSENSE_BUTTON1_GESTURE_DIRECTION_OFFSET                             (102u)
#define CY_CAPSENSE_BUTTON1_GESTURE_DIRECTION_SIZE                               (2u)
#define CY_CAPSENSE_BUTTON1_GESTURE_DIRECTION_PARAM_ID                           (0x02010066u)

#define CY_CAPSENSE_BUTTON1_XDELTA_VALUE                                         (cy_capsense_tuner.widgetContext[1].xDelta)
#define CY_CAPSENSE_BUTTON1_XDELTA_OFFSET                                        (104u)
#define CY_CAPSENSE_BUTTON1_XDELTA_SIZE                                          (2u)
#define CY_CAPSENSE_BUTTON1_XDELTA_PARAM_ID                                      (0x02010068u)

#define CY_CAPSENSE_BUTTON1_YDELTA_VALUE                                         (cy_capsense_tuner.widgetContext[1].yDelta)
#define CY_CAPSENSE_BUTTON1_YDELTA_OFFSET                                        (106u)
#define CY_CAPSENSE_BUTTON1_YDELTA_SIZE                                          (2u)
#define CY_CAPSENSE_BUTTON1_YDELTA_PARAM_ID                                      (0x0201006au)

#define CY_CAPSENSE_BUTTON1_NOISE_TH_VALUE                                       (cy_capsense_tuner.widgetContext[1].noiseTh)
#define CY_CAPSENSE_BUTTON1_NOISE_TH_OFFSET                                      (108u)
#define CY_CAPSENSE_BUTTON1_NOISE_TH_SIZE                                        (2u)
#define CY_CAPSENSE_BUTTON1_NOISE_TH_PARAM_ID                                    (0x0601006cu)

#define CY_CAPSENSE_BUTTON1_NNOISE_TH_VALUE                                      (cy_capsense_tuner.widgetContext[1].nNoiseTh)
#define CY_CAPSENSE_BUTTON1_NNOISE_TH_OFFSET                                     (110u)
#define CY_CAPSENSE_BUTTON1_NNOISE_TH_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON1_NNOISE_TH_PARAM_ID                                   (0x0601006eu)

